# Taps
tap "nicoverbruggen/cask"
tap "steipete/tap"
tap "steveyegge/beads"
# tap "microsoft/mssql-release"

# Binaries
brew "bash" # Latest Bash version
brew "bat" # Used for spatie/visit
brew "bottom"
brew "tree"
brew "coreutils" # Those that come with macOS are outdated
brew "ffmpeg"
brew "gh"
brew "ggh"
brew "git"
brew "grep"
brew "httpie"
brew "jq" # Used for spatie/visit flexible command-line JSON processor
brew "mas" # Mac App Store manager
brew "composer"
brew "uv"
brew "eza"
brew "ncdu"
brew "ack"
brew "starship"
brew "ripgrep" # Blazing fast better grep
brew "fd" # better file finder
brew "fzf" # Fuzzy command line search
brew "zoxide" # Smarter cd command
brew "node"
brew "poppler"
brew "steipete/tap/imsg"
brew "steveyegge/beads/bd"

# KI Tools
brew "llm"

# Software
brew "docker", link: false

# brew "microsoft/mssql-release/msodbcsql18"
# brew "microsoft/mssql-release/mssql-tools18"

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew "imagemagick"
brew "php"
brew "mago"

# Tooling Apps OS
cask "raycast"
cask "1password"
cask "1password-cli"
cask "imageoptim"

# Development and CLI
cask "github"
cask "sourcetree"
cask "tableplus"
# cask "insomnia"
# cask "postman"
cask "yaak"
cask "ray"
cask "tinkerwell"
cask "transmit"
cask "iterm2"
cask "warp"
cask "vagrant" # Dont forget `vagrant plugin install vagrant-parallels`
cask "docker-desktop"

# KI Tools
cask "claude"
cask "chatgpt"

# IDEs
cask "visual-studio-code"
cask "phpstorm"
cask "zed"

# Browser
cask "firefox"
cask "google-chrome"
cask "arc"
cask "brave-browser"

# Communication
cask "discord"
cask "signal"
cask "whatsapp"

# Others
cask "bartender"
cask "cleanshot"
cask "obsidian"
cask "spotify"
cask "pdf-expert"
cask "carbon-copy-cloner"
cask "zoom"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg"

# Mac App Store
mas "Aspen", id: 6475777033
mas "Commander One", id: 1035236694
mas "The Unarchiver", id: 425424353
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Speedtest", id: 1153157709
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "LanScan", id: 472226235
mas "Voice Type", id: 6736525125
