# Taps
# tap 'homebrew/cask' # not longer necessary
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'mongodb/brew'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'tree'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'php' # Used to install xdebug or other extensions for herd
brew 'composer'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'meilisearch'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'mongodb-community'

# Tooling Apps OS
cask 'raycast'
cask '1password'
cask 'imageoptim'

# Development
cask 'github'
cask 'sourcetree'
cask 'dbngin'
cask 'tableplus'
cask 'docker'
cask 'helo'
cask 'herd'
cask 'insomnia'
cask 'postman'
cask 'phpmon' # Still needed because of Herd
cask 'ray'
cask 'tinkerwell'
cask 'transmit'
cask 'visual-studio-code'
# cask 'jetbrains-toolbox'
cask 'phpstorm'
cask 'tower'
cask 'iterm2'
cask 'vagrant'

# Browser
cask 'firefox'
cask 'google-chrome'
cask 'arc'

# Communication
cask 'discord'
cask 'signal'
cask 'whatsapp'
# cask 'franz'
# cask 'telegram-desktop'
# cask 'slack'

# Others
cask 'warp'
cask 'bartender'
cask 'cleanshot'
cask 'the-unarchiver'
cask 'deepl'
cask 'obsidian'
cask 'spotify'
cask 'pdf-expert'
cask 'carbon-copy-cloner'
cask 'readdle-spark'
cask 'zoom'
#cask 'libreoffice'
#cask 'libreoffice-language-pack'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Moom', id: 419330170
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Commander One', id: 1035236694
mas 'The Unarchiver', id: 425424353
# mas 'Spark', id: 1176895641
# mas 'Spark + AI', id: 997102246
mas 'LanScan', id: 472226235
mas 'Reeder 5', id: 1529448980
mas 'Pixelmator Pro', id: 1289583905
mas 'Feedly', id:396069556
