# Taps
tap "nicoverbruggen/cask"
# tap "microsoft/mssql-release"

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'tree'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit flexible command-line JSON processor
brew 'mas' # Mac App Store manager
brew 'composer'
brew 'uv'
brew 'eza'
brew 'ncdu'
brew 'ack'

# KI Tools
brew 'llm'

# Software
brew 'docker", link: false

# brew 'microsoft/mssql-release/msodbcsql18'
# brew 'microsoft/mssql-release/mssql-tools18'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'node'

# Tooling Apps OS
cask 'raycast'
cask '1password'
cask '1password-cli'
cask 'imageoptim'

# Development and CLI
cask 'github'
cask 'sourcetree'
cask 'tableplus'
cask 'insomnia'
cask 'postman'
cask 'ray'
cask 'tinkerwell'
cask 'transmit'
cask 'iterm2'
cask 'warp'
cask 'vagrant'
cask 'docker-desktop'

# KI Tools
cask 'claude'
cask 'chatgpt'

# IDEs
cask 'visual-studio-code'
cask 'phpstorm'
cask 'zed'

# Browser
cask 'firefox'
cask 'google-chrome'
cask 'arc'

# Communication
cask 'discord'
cask 'signal'
cask 'whatsapp'

# Others
cask 'bartender'
cask 'cleanshot'
cask 'obsidian'
cask 'spotify'
cask 'pdf-expert'
cask 'carbon-copy-cloner'
# cask 'readdle-spark'
cask 'zoom'
# cask 'libreoffice'
# cask 'libreoffice-language-pack'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-fira-code'

# Mac App Store
mas "Aspen", id: 6475777033
mas 'Commander One', id: 1035236694
mas 'The Unarchiver', id: 425424353
mas 'LanScan', id: 472226235
mas 'Moom Classic', id: 419330170
mas 'Pixelmator Pro', id: 1289583905
mas 'Reeder', id: 1529448980
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
